[
  {
    "path": "posts/2023-03-18-foia-data-portal/",
    "title": "FOIA Data Portal",
    "description": "A portal that I built for FOIA Reports data",
    "author": [
      {
        "name": "Grant Li",
        "url": {}
      }
    ],
    "date": "2023-03-18",
    "categories": [],
    "contents": "\r\nFor our final project in my data science class, we had the option to either make static data visualizations, or a shiny application. I decided to make a shiny application. You can find this portal at https://grantli.shinyapps.io/foiaapp/.\r\nMy research at the Deportation Research Clinic involves a lot of Freedom of Information Act (FOIA) requests, particularly with the Executive Office of Immigration Review (EOIR). The government often takes far longer to respond than what the law allows for. To force the government to follow the law and respond to our FOIA requests, we file complaints in court. One of the arguments that we have wanted to make with regards to this is that our the government under-funds EOIR’s FOIA response capabilities. To help prove this and help others have access to similar information, I built this portal using Department of Justice (DOJ) FOIA data.\r\nEssentially, government departments or agencies must put out a FOIA report every year with statistics on how they responded to FOIA requests that year. Unfortunately, up until now, much of this data was quite inaccessible. They are usually in XML files or PDF tables, and not aggregated well across agencies. There have been no data visualizations of this type of data. Luckily, there is a data portal where you can download CSV’s (comma-separated values, just think Excel spreadsheet) of department level data at: https://www.foia.gov/reports.html. Unfortunately the data portal sort of broke down (for me, at least) every time too many statistical measures were selected, so I downloaded them separately and manually collated them together.\r\nI hope that providing this portal will help make this data more accessible and understandable. Already, the data corroborates the argument that the EOIR’s FOIA respose capabilities are seriously underfunded. In the future, I intend on expanding it if I can to provide data for not just the DOJ.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-03-18T12:34:24-07:00",
    "input_file": "foia-data-portal.knit.md"
  },
  {
    "path": "posts/2023-01-31-chinese-demographics-in-litchfield-county/",
    "title": "Chinese Demographics in Litchfield County",
    "description": "Using census data to investigate Chinese demographics in Litchfield County, CT",
    "author": [
      {
        "name": "Grant Li",
        "url": {}
      }
    ],
    "date": "2023-01-31",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nChinese demographics in Litchfield County, CT\r\n\r\nI recently learned how to do maps in an R data visualization class at school. I found it pretty interesting. For example, here is a map I made for Rochester, New York that shows major roads and elevation. We were told we could make this as simple or as cool as we wanted, so I actually tried to do something unique and cool. I’ve always loved topographical maps because I love war history, and topography is key to understanding much of war strategy.\r\n\r\n\r\n\r\nHollister (2022); Pebesma (2022); Walker and Herman (2023); Garnier (2021); Pebesma (2018); Wickham et al. (2019);1\r\nChinese demographics in Litchfield County, CT\r\nLater, there was a bonus (worth 0 points?!) to make an interactive map on your own. They did not actually teach us how to do the interactive part, so it was entirely up to us whether we wanted to teach ourselves or not. After doing a lot of digging and research, I figured out how to make an interactive map for the Chinese population in Litchfield County, Connecticut. I was specifically interested in this particular county because I am Chinese and grew up in New Milford, a town in Litchfield County.\r\n\r\n\r\n\r\nCheng, Karambelkar, and Xie (2022)\r\nWhat can we learn from this map? There appears to be 4 main concentrations of Chinese people around Litchfield County: New Milford (yellow), Kent on the middle-left (green), Salisbury on the top-left (blue), and some patches of turquoise near Waterbury on the bottom-right.\r\nNow if you are from the area, you will know that Waterbury is quite big of a city, so it’s entirely unsurprising that there are more Chinese people living in their suburbs. Additionally, New Milford is the last sizeable population aside from Torrington before going any further north, and also acts somewhat like a suburb of Danbury. It makes sense that there are some Chinese residents here. However, Kent and Salisbury are a little more puzzling; both have about two streets in their town. Even New Milford having 103 people in that one yellow census tract is extremely surprising: having lived there, I basically knew almost every Chinese family in town and could basically count them on my fingers. Where were they all?\r\nWell it turns out, what New Milford, Kent, and Salisbury all have in common are private schools. The rich, old money, elite kind. In New Milford, we have the Canterbury School, Kent has the Kent School, and Salisbury has perhaps the most notorious of the three: the Hotchkiss School. Rich Chinese families are sending their kids to these private schools. There are probably a bunch of Chinese students within Canterbury’s campus that I have simply never seen before (I attended the town’s public school, New Milford High School).\r\nI hope you found this interesting!\r\n\r\n\r\n\r\nCheng, Joe, Bhaskar Karambelkar, and Yihui Xie. 2022. Leaflet: Create Interactive Web Maps with the JavaScript Leaflet Library. https://rstudio.github.io/leaflet/.\r\n\r\n\r\nGarnier, Simon. 2021. Viridis: Colorblind-Friendly Color Maps for r. https://CRAN.R-project.org/package=viridis.\r\n\r\n\r\nHollister, Jeffrey. 2022. Elevatr: Access Elevation Data from Various APIs. https://github.com/jhollist/elevatr/.\r\n\r\n\r\nPebesma, Edzer. 2018. “Simple Features for R: Standardized Support for Spatial Vector Data.” The R Journal 10 (1): 439–46. https://doi.org/10.32614/RJ-2018-009.\r\n\r\n\r\n———. 2022. Sf: Simple Features for r.\r\n\r\n\r\nWalker, Kyle, and Matt Herman. 2023. Tidycensus: Load US Census Boundary and Attribute Data as Tidyverse and Sf-Ready Data Frames. https://walker-data.com/tidycensus/.\r\n\r\n\r\nWickham, Hadley, Mara Averick, Jennifer Bryan, Winston Chang, Lucy D’Agostino McGowan, Romain François, Garrett Grolemund, et al. 2019. “Welcome to the tidyverse.” Journal of Open Source Software 4 (43): 1686. https://doi.org/10.21105/joss.01686.\r\n\r\n\r\nRochester municipal boundaries shape file was obtained here: https://data.cityofrochester.gov/datasets/8d69bba78ba94305a467e9e8bf497570_0/explore?location=43.185221%2C-77.619085%2C5.64↩︎\r\n",
    "preview": "posts/2023-01-31-chinese-demographics-in-litchfield-county/distill-preview.png",
    "last_modified": "2023-03-18T10:46:36-07:00",
    "input_file": {},
    "preview_width": 787,
    "preview_height": 486
  }
]
